Every year, American high school students take SATs, which are standardized tests intended to measure literacy, numeracy, and writing skills. There are three sections - reading, math, and writing, each with a **maximum score of 800 points**. These tests are extremely important for students and colleges, as they play a pivotal role in the admissions process.

Analyzing the performance of schools is important for a variety of stakeholders, including policy and education professionals, researchers, government, and even parents considering which school their children should attend.

In [1]:
# Re-run this cell 
import pandas as pd
import sqlite3

# Read in the dataset called schools.csv
schools = pd.read_csv("schools.csv")

# Preview the data
schools.head()

# Connecting it to the SQL database
conn = sqlite3.connect(':memory:')

# Write the DataFrame 
schools.to_sql('schools', conn, index=False, if_exists='replace')

375

To view the data

In [2]:
SELECT *
FROM schools;

SyntaxError: invalid syntax (2323170160.py, line 1)

Find out which NYC schools have the best math results, achieving at least 80% of the *maximum possible score of 800* in math.

In [ ]:
SELECT school_name, average_math
FROM schools
WHERE average_math > 800*0.8
ORDER BY average_math DESC;

                                         school_name  average_math
0                             Stuyvesant High School           754
1                       Bronx High School of Science           714
2                Staten Island Technical High School           711
3  Queens High School for the Sciences at York Co...           701
4  High School for Mathematics, Science, and Engi...           683
5                     Brooklyn Technical High School           682
6                        Townsend Harris High School           680
7  High School of American Studies at Lehman College           669
8  New Explorations into Science, Technology and ...           657
9                      Eleanor Roosevelt High School           641

Add a new column called "total_SAT" by summing the math, reading, and writing scores in the original DataFrame using Python

In [ ]:
schools["total_SAT"] = schools["average_math"] + schools["average_reading"] + schools["average_writing"]
print(schools)

                                           school_name  ... total_SAT
0    New Explorations into Science, Technology and ...  ...      1859
1                                 Essex Street Academy  ...      1193
2                         Lower Manhattan Arts Academy  ...      1261
3      High School for Dual Language and Asian Studies  ...      1529
4        Henry Street School for International Studies  ...      1197
..                                                 ...  ...       ...
370  Queens High School for Information, Research, ...  ...      1086
371  Rockaway Park High School for Environmental Su...  ...      1114
372                   Channel View School for Research  ...      1280
373                    Rockaway Collegiate High School  ...      1207
374                                  Scholars' Academy  ...      1716

[375 rows x 8 columns]

Identify the top 10 performing schools based on the combined SAT scores

In [ ]:
SELECT school_name, total_SAT
FROM schools 
ORDER BY total_SAT DESC
LIMIT 10;

                                         school_name  total_SAT
0                             Stuyvesant High School       2144
1                Staten Island Technical High School       2041
2                       Bronx High School of Science       2041
3  High School of American Studies at Lehman College       2013
4                        Townsend Harris High School       1981
5  Queens High School for the Sciences at York Co...       1947
6                     Bard High School Early College       1914
7                     Brooklyn Technical High School       1896
8                      Eleanor Roosevelt High School       1889
9  High School for Mathematics, Science, and Engi...       1889

Find which borough has the largest standard deviation in the combined SAT scores by running this code:

In [ ]:
SELECT borough,
	COUNT(school_name) AS num_schools,
	ROUND(AVG(total_SAT),2) AS average_SAT,
	ROUND(STDDEV(total_SAT),2) AS std_SAT
FROM schools 
GROUP BY borough
ORDER BY std_SAT DESC
LIMIT 1;

     borough  num_schools  average_SAT  std_SAT
0  Manhattan           89      1340.13   230.29